import Control.Applicative

main = do
    print $ [(*0), (+100), (^2)] <*> [1,2,3]
    print $ [(+), (*)] <*> [1,2] <*> [3,4]
    print $ (++) <$> ["ha", "heh", "hmm"] <*> ["?", "!", "."]
    -- リスト内包表記
    print $ [x*y | x <- [2,5,10], y <- [8,10,11]]
    -- アプリカティブスタイル
    print $ (*) <$> [2,5,10] <*> [8,10,11]
    print $ filter (>50) $ (*) <$> [2,5,10] <*> [8,10,11]
    -- 関数もアプリカティブ
    print $ (pure 3) "blah"
    print $ (+) <$> (+3) <*> (*100) $ 5
    print $ (\x y z -> [x,y,z]) <$> (+3) <*> (*2) <*> (/2) $ 5
